Тест_ЗУП_31_КОРП/src/Enums/ПорядокНачисленияСеверныхНадбавок/ПорядокНачисленияСеверныхНадбавок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПорядокНачисленияСеверныхНадбавок</name>
  <enumValues>
    <name>Группа1Обычная</name>
  </enumValues>
  <enumValues>
    <name>Группа2Обычная</name>
  </enumValues>
  <enumValues>
    <name>Группа3Обычная</name>
  </enumValues>
  <enumValues>
    <name>Группа4Обычная</name>
  </enumValues>
  <enumValues>
    <name>Группа1Льготная</name>
  </enumValues>
  <enumValues>
    <name>Группа2Льготная</name>
  </enumValues>
  <enumValues>
    <name>Группа3Льготная</name>
  </enumValues>
  <enumValues>
    <name>Группа4Льготная</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/ПорядокНачисленияСеверныхНадбавок/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает массив описаний шкалы порядка начисления северной надбавки.
//
// Параметры:
//			ПорядокНачисления - ПеречислениеСсылка.ПорядокНачисленияСеверныхНадбавок
//
// ВозвращаемоеЗначение:
//			Массив структур:
//					РазмерПериода - Число, период в месяцах.
//					РазмерПрироста - Число, размер прироста в %.
//					Ограничение - Число, максимально возможный процент.
//
Функция ОписаниеШкалыПоПорядкуНачисления(ПорядокНачисления) Экспорт
	
	ОписаниеШкалы = Новый Массив;
	
	// В общем случае шкала может состоять из двух участков.
	Если ПорядокНачисления = ПредопределенноеЗначение("Перечисление.ПорядокНачисленияСеверныхНадбавок.Группа1Льготная") Тогда
		ОписаниеШкалы.Добавить(Новый Структура("РазмерПериода,РазмерПрироста,Ограничение",6,20,60));
		ОписаниеШкалы.Добавить(Новый Структура("РазмерПериода,РазмерПрироста,Ограничение",6,10,100));
	ИначеЕсли ПорядокНачисления = ПредопределенноеЗначение("Перечисление.ПорядокНачисленияСеверныхНадбавок.Группа1Обычная") Тогда
		ОписаниеШкалы.Добавить(Новый Структура("РазмерПериода,РазмерПрироста,Ограничение",6,10,100));
	ИначеЕсли ПорядокНачисления = ПредопределенноеЗначение("Перечисление.ПорядокНачисленияСеверныхНадбавок.Группа2Льготная") Тогда
		ОписаниеШкалы.Добавить(Новый Структура("РазмерПериода,РазмерПрироста,Ограничение",6,20,60));
		ОписаниеШкалы.Добавить(Новый Структура("РазмерПериода,РазмерПрироста,Ограничение",12,20,80));
	ИначеЕсли ПорядокНачисления = ПредопределенноеЗначение("Перечисление.ПорядокНачисленияСеверныхНадбавок.Группа2Обычная") Тогда
		ОписаниеШкалы.Добавить(Новый Структура("РазмерПериода,РазмерПрироста,Ограничение",6,10,60));
		ОписаниеШкалы.Добавить(Новый Структура("РазмерПериода,РазмерПрироста,Ограничение",12,10,80));
	ИначеЕсли ПорядокНачисления = ПредопределенноеЗначение("Перечисление.ПорядокНачисленияСеверныхНадбавок.Группа3Льготная") Тогда
		ОписаниеШкалы.Добавить(Новый Структура("РазмерПериода,РазмерПрироста,Ограничение",6,10,50));
	ИначеЕсли ПорядокНачисления = ПредопределенноеЗначение("Перечисление.ПорядокНачисленияСеверныхНадбавок.Группа3Обычная") Тогда
		ОписаниеШкалы.Добавить(Новый Структура("РазмерПериода,РазмерПрироста,Ограничение",12,10,50));
	ИначеЕсли ПорядокНачисления = ПредопределенноеЗначение("Перечисление.ПорядокНачисленияСеверныхНадбавок.Группа4Льготная") Тогда
		ОписаниеШкалы.Добавить(Новый Структура("РазмерПериода,РазмерПрироста,Ограничение",6,10,30));
	ИначеЕсли ПорядокНачисления = ПредопределенноеЗначение("Перечисление.ПорядокНачисленияСеверныхНадбавок.Группа4Обычная") Тогда
		ОписаниеШкалы.Добавить(Новый Структура("РазмерПериода,РазмерПрироста,Ограничение",12,10,10));
		ОписаниеШкалы.Добавить(Новый Структура("РазмерПериода,РазмерПрироста,Ограничение",24,10,30));
	КонецЕсли;
	
	Возврат ОписаниеШкалы;
	
КонецФункции

#КонецОбласти

#КонецЕсли
